/*

힌트 :		 
		 Step #7
		 	- 이미지 정보  출력하기.
		 
		 Step #6
		 	- Ajax을 이용해서 외부 데이터 연동처리하기.
		 
		 	Step #6-2
		 		- 동적으로 썸네일 목록 생성하기.
		 		
		 	Step #6-1
		 		- image_gallery.xml 파일 만들기.
		 		
		 Step #5
		 	- 이전, 다음 이미지 처리하기.
		 	
		 	Step #5-3
		 		- 이전,다음 이미지 활성화에 따른 페이지 처리하기.
		 		
		 	Step #5-2
		 		- 이전, 다음 이미지 활성화 시키기.
		 		
		 	Step #5-1. 
		 		- 네비게이션 활성화 시키기.
		 	
		 Step #4
		 	- 선택된 썸네일에 커서 이동시키기.
		 	
		  Step #3
		  	- 선택 이미지 활성화 시키기.
		  	
		  	
		  	Step #3-4
		  		- 이미지 로딩 취소처리하기.
		  		
		  		
		  	Step #3-3		  	
		  		- 핵심이슈 적용시키기.
		  		
		  	Step #3-2
		  		- 이미지 로딩 패널 보이기/ 숨기기.
		  		
		  	Step #3-1
		  		- 선택 이미지 로드하기.
		  		
		  		
		  Step #2
		 	- 페이징 처리하기.
		 	
		 	Step #2-3
		 		- 리팩토링.
		 		
		 	Step #2-2
		 		- 페이지 애니메이션 효과 구현.
		 		 
		 	Step #2-1
		 		- 페이지 정보 구하기.
		 		
		 Step #1		 
		 	- 레이아웃 잡기.
		 
*/
$(document).ready(function(){
	// 여기서부터 시작.
});
